{"id":202,"title":"Using this guide","guideName":"demo-guide","pageLinks":[],"metaData":{"index":["202"]},"etag":"0c3a8c8746ac1cb890770f9d6754ceeb","text":"This guide is a mobile web application and can be used like any other\nweb application.  It does have some special features though, some of\nwhich may not be obvious.\n\n* If you bookmark the guide you can access it even when you're\n  offline inside a building or outside 3G or WiFi range.\n* Whenever you see a grid icon with a number, if you hit the `Keypad`\n  menu at the top left of the screen and type the number into the\n  keypad you will be taken to information about the item associated\n  with that number.\n* You can tap most images to get a larger view, which you can pan by\n  touching and moving, and scale by pinch zoom (where available).\n* Some items are part of tours.  You'll see a small grey bar on the\n  side of the screen.  When this is present swiping the screen moves\n  back and forward.\n* The menu bar below contains all the common menus\n\n\nFrom left to right these are:\n\n* _Menu_. Shows the main navigation menu, which is always available.\n* _Keypad_. Touching this menu pulls up the keypad.  If you type the\n    number of an exhibit you will be taken to its page in the guide.\n* _Shop_.  If the cart is red takes you to items particularly\n    appropriate for the current page Otherwise brings up the shop.\n* _Tour_.  Some pages are part of a larger tour.  If the page you\n    are on is part of a tour then touching this menu item will take\n    you to the tour home page.\n* _Map_. Some items, which have a physical location, can be viewed on a\n    map. A guide can have several maps, but each map item occurs on\n    only one map.  If you touch the map button the item's map will be\n    shown, with the item in solid blue.  Other items will be\n    semi-transparent. If you go to the map directly all items are visible.\n\n----\n\nThere is some information about the technology\n[here](../../cilogi-tech.html)."}