{"id":600,"title":"History of Glasgow Botanic Gardens","guideName":"demo-guide","pageLinks":[],"metaData":{"index":["600"],"isGallery":["true"]},"etag":"dcf0c201c15f9f15ce749662c4f0deef","text":"Glasgow Botanic Gardens have had a varied history.  They evolved from\na Physic Garden established in the grounds of the old College in 1705,\nfor teaching purposes and maintained for about one hundred years.  The\nGardens were ultimately re-established in the West End in May 1817,\nwhen the work of laying out a botanic garden was begun on an eight\nacre site at Sandyford, at the west end of Sauchiehall Street\n\n![Sandyford](../../media/images/sandyford.jpg)\n\nThis site was acquired by [Thomas Hopkirk](/wiki/Thomas_Hopkirk) who founded the Royal Botanic\nInstitution of Glasgow. The Institution managed the Gardens until they\nwere taken over by the Corporation in 1891.\n\n![Thomas Hopkirk](../../media/images/hopkirk.jpg)\n\nFunds were raised by public subscription, and the University made a\nsubstantial contribution on the understanding that a room was set\naside for the Professor of Botany to deliver lectures, and that plant\nmaterial for the students was also supplied by the gardens. In 1818\nthe Crown gave a donation and also granted a [Royal Charter](/wiki/Royal_charter). Also in\nthat year the University appointed the first Regius Professor of\nBotany, [Dr Robert Graham](/wiki/Robert_Graham_%28botanist%29), and he took an active part in the formation\nof the new Gardens. Hopkirk gifted the plants cultivated in his own\ngarden at Dalbeth to form the nucleus of the new Botanic Gardens.\n\n[William Jackson Hooker](/wiki.html?target=William_Jackson_Hooker),\none of the most outstanding of British botanists. was appointed to the\nchair of Botany at Glasgow in 1821. He was largely responsible for the\nremarkable success of the Gardens in the early years. This was a\nperiod when many new plants were being introduced into cultivation and\nHooker carried out much of the work on the description of these\nspecies, and the publication of botanical drawings of them. It was\nmainly due to his work that within ten years of its foundation Glasgow\nBotanic Gardens already had a prominent position in the world of\nbotany.\n\nThe rapid expansion of Glasgow soon made the small eight acre site at\nSandyford unsuitable and by 1839 an area had been purchased in the\nnewly opened estate of\nKelvinside. [Sir Joseph Paxton](/wiki.html?target=Joseph_Paxton)\n(1803-65) was commissioned to design a new garden on the lands on the\nsouth bank of the gorge section of the River Kelvin.\n\nThe crucial years of transfer to the Kelvinside site were the peak of\nStewart Murray's long and distinguished career as the first Curator of\nthe Botanic Garden. In part the structure of the Gardens we know today\nwas laid down by him.\n\n![Stewart Murry Layout](../../media/images/stewart-murray-layout.jpg)\n\nThis plan taken from the 1842 map by R. Manin shows the original\nlayout planned by Stewart Murray.\n\nMurray was born in Aberdeenshire in April 1790. Little is known of his\nearly years, but by the time he was 17 he was in Glasgow. As a\ngardener at nearby Dalbeth he was much involved with Thomas Hopkirk1s\nplant collection and he was appointed Curator of the new Botanic\nGarden in 1817. As well as being a skilled and knowledgeable\nplantsman, Murray was a landscape designer of some note. Not only was\nthe layout of both Botanic Gardens principally his but he was closely\ninvolved in the layout of the Glasgow Necropolis and he designed and\nlaid out the cemeteries at Sighthill, Glasgow, and at Paisley and\nGreenock. After retiring in 1852 he continued as Consulting Curator.\n\n![Murray Layout Photo](../../media/images/murray-layout-photo.jpg)\n\nThe present Botanic Gardens were laid out and the collection\ntransferred along with the original range of glasshouses. The only\nplant from the old Garden known to be in the collection today is a\nWeeping Ash tree which can be seen to the south of the main lawn.\n\n![Weeping Ash](../../media/images/weeping-ash.jpg)\n\nThe move was completed in 1842 and the Gardens then opened to members\nof the Royal Botanical lnstitution and their families for an annual\nsubscription of one guinea. Later the public were admitted on selected\ndays for the sum of one penny. Glasgow Corporation took over full\nownership of the Botanic gardens in 1891 and since that time the\ngrounds and glasshouses have opened daily free of charge to all\nvisitors.\n\nThe jewel in the crown of structures within the Gardens is undoubtedly\nthe Kibble Palace, by John Kibble.\n\nSome controversy surrounds the Kibble Palace as it became known, as\nSir Joseph Paxton was credited with its design and. as an engineer,\nJohn Kibble would have been familiar with Paxton's other work and his\nassociation with the Crystal Palace.\n\nJohn Kibble had the glasshouse built as a conservatory at his home in\nCoulport on Loch Long.\n\nKibble offered the structure to Glasgow for erection in Queen's Park,\nbut, when the city dithered, he withdrew his offer and it was moved to\nits present site in 1873, following an agreement between himself and\nthe Royal Botanic Institution. The agreement was to run for twenty one\nyears and involved an annual payment which became a serious burden to\nthe Institution within a few years. In 1881, as a result of a loan of\n£25,000 granted by the Corporation of Glasgow, the Institution was\nable to buy out the lease for £10,000.\n\nThe conservatory was dismantled at Coulport in May 1872 and brought to\nthe Gardens via Bowling on the lower reaches of the River Clyde, and\nup the Forth and Clyde Canal to Port Dundas. It was re-erected, with\nconsiderable extensions, by James Boyd and Sons of Paisley.\n\nIn 1874 the Kibble Crystal Art Palace and Conservatory as it was then\nknown, had 39 statues as advertised in Tweed's Guide to Glasgow of\n1874.\n\n![Kibble Palace in 1875](../../media/images/kibble-1875.jpg)\nThis image of the Kibble taken in 1875 shows the large hall erected\nfor John Kibbles oxy-hydrogen lantern performances.\n\n\nIt was entered from the central corridor. Kibbles' intention was to\nuse the building for concerts and public meetings, this continued for\nabout ten years during which time many large meetings took place. The\nAmerican Evangelists, Moody and Sankey, preached to a crowd of several\nthousand people outside the Kibble Palace. Both Benjamin Disraeli and\nWilliam Ewart Gladstone were installed as Lord Rectors of the\nUniversity of Glasgow in 1873 and 1879, and delivered their Rectorial\naddresses in the Kibble Palace.\n\n![Disraeli installed as Rector in 1873](../../media/images/disraeli-rector.jpg)\n\nFrom the 18801s the Kibble was planted up with temperate plants\nincluding an important collection of tree ferns from the southern\nhemisphere.\n\n![Kibble Ferns](../../media/images/kibble-ferns.jpg)\n\nTo this day John Kibble has been the only person to Bicycle across\nLoch Long on floats.\n\nIn 1875 an ornamental iron bandstand was erected on the lawn in front\nof the Main Range of Glasshouses.\n\n![Bandstand](../../media/images/bandstand.jpg)\n\nThe Band of Prince Albert's Light Infantry were first to perform here\non 4 August 1875. By 1912 a new pavilion style band-stand was\nconstructed on the site now occupied by the World Rose Garden. This\nwas used for military and local brass bands, and children's\nentertainment of the seaside type. These provided a moral boost during\nthe two World Wars but by the late 1950's they were attracting little\npublic interest. Sadly the bandstand was demolished in 1965.\n\nThe loan from the Corporation was also intended for the rebuilding of\nthe Main Range Glasshouses, which was by this time in a serious state\nof disrepair, having come from the old site. The new range of houses\nwas built on the same site and opened in early 1883. \n\nThe taking of this loan proved a fateful point of history of the\nInstitution. By 1885 the financial position had become critical, but\nrather than sell up the Gardens, the Institution wished to maintain\nwhat had been built up for the City and so made moves in favour of the\nCorporation taking over. On 1st April 1887 Glasgow Corporation entered\ninto possession as creditors and the Gardens were closed, maintenance\nwork continued at the Corporations expense.\n\nThe City of Glasgow Act 1891, provided that, 'the gardens and the\nproperty and effects of the Botanic Institution should be transferred\nto and vested in the Corporation, to be kept open, preserved and\nmaintained as a public area and botanic gardens for all time', and\nalso to continue the privileges of the University for the teaching of\nbotany. Thus the original intentions of the founders have been\nsafeguarded, and the position of the Gardens in the lie ofthe City has\nbeen maintained.\n\n![1890 map](../../media/images/1890map.jpg)\n\nThis 1890 map of the Botanic Gardens shows how the gardens extended\neast of the current Queen Margaret Drive into the neighbouring North\nPark Estate which originally belonged to John Hamilton, who was thrice\nLord Provost of the city.\n\n![North Park House](../../media/images/northparkhouse.jpg)\n\nNorth Park House (the former BBC Scotland Building) was purchased in\n1882 by Mrs Isabella Elder (1828- 1905) wife of the famous John Elder\none of the founder members of the Fairfield Shipyard in Govan. She had\nthe house converted in 1883 into a college for women named after Queen\nMargaret (1046-1093), the wife of Scottish King Malcolm Canmore King\nMalcolm Ill) (1031-1093). \n\nThe College was unique in Scotland as a Women's College that offered\nuniversity level teaching in both arts and medicine. In 1892 Queen\nMargaret College became part of the University of Glasgow and all\nteaching was transferred to Gilmorehill in 1935.  By the 1920's the\nnew Queen Margaret Drive and Bridge were constructed resulting in this\nsection of the gardens being lost"}