{"id":710,"title":"Wellingtonia","guideName":"botanics","images":["wellingtonia.jpg"],"pageLinks":[],"metaData":{"sku":["0881929743"],"index":["710"],"tag":["tree-trail"]},"etag":"1d65b52c68d8991e9ab1c7671d63e589","text":"<p class=\"species-info\"><em>Sequoiadendron giganteum</em>  J Buchholz.</p>\n\nNative Range: The western United States to the west of the Sierra Nevada mountains.\n\nThe biggest trees in the world are Sequoiadendron giganteum growing in the United States.\n\nThe species was first introduced into Britain in 1853 by John Matthew who sent seeds to his father in Perth.\n\nWilliam Lobb also sent seeds to the famous plant nursery of James Veitch and Co. in Chelsea. There they propagated\n  trees for more general sale (12 guineas a dozen).\n\n‘Sequoia’ is thought to be in honour of Sequoyah (c1765-1843), the first native American to convert the (Cherokee)\n  language into written form; ‘Dendron’ is Greek for ‘tree’.\n\nIn an attempt to save the remaining stands of _Sequoiadendron giganteum_ from loggers, John Muir of Dunbar (1838-1914)\n  campaigned in the United States for a policy of forest conservation. This led to the first national park.\n\nThe timber of the tree is brittle and of low value as lumber. Undeterred, the loggers felled the great trees for\n  roof shingles (wooden slates) and cheap fencing for farmers.\n\nThe trees are considered young or immature until they are around 100 years old when they may have grown up to 50 metres tall.\n\nThe number of naturally occurring _Sequoiadendron giganteum_ is declining and the ‘Big Trees’ now have IUCN endangered status.\n\nThis tree was planted in 1993 and is documented on the National Tree Register. If you would like to see mature examples\nof Giant Redwoods then visit the Royal Botanic Gardens Benmore near Dunoon. It is a member of the National Tree\nCollections of Scotland. Benmore has a long avenue of fifty Giant Redwoods, planted in 1863 by the then owners,\nthe Younger family.\n\nUCN red list at [www.iucnredlist.org](http://www.iucnredlist.org)"}