{"id":718,"title":"Moroccan Fir","guideName":"botanics","images":["moroccan-fir.jpg"],"pageLinks":[],"metaData":{"sku":["0881929743"],"index":["718"],"tag":["tree-trail"]},"etag":"7fa9d280133ec08e4ee40423e72dafd2","text":"<p class=\"species-info\"><em>Abies pinsapo</em> var <em>marocana</em> Ceballos & Bolanus.</p>\n\nNative Range: Mountain range near Chechaouen, Morocco.\n\nThe tree is found on north facing slopes with an optimal altitude of between 1,400 and 1,800 metres. It was only\nidentified as being distinct from the Spanish Fir,_Abies pinsapo_ var _pinsapo_, in 1906 and arrived in European parks\nand botanic gardens in the 1950s.\n\nThe tree is threatened in its native range by logging, fires and forest clearance. The remaining stands are mostly\n  within National Parks but even these are under pressure from clearance for cannabis cultivation. (IUCN Red List Data)\n\nThe timber is used locally in the construction industry. The twigs can be mashed in water to produce soap hence the\n  Spanish common name for the species ‘Soap Pine’ and the seeds contain an essential oil that is used in Moroccan folk\n  medicine to treat respiratory problems\n\nThe subspecies has an IUCN conservation rating of ‘Endangered’\n\nThis tree is part of the International Conifer Conservation Programme which is run by Royal Botanic Gardens\nEdinburgh, with its remit to conserve and protect threatened and vulnerable conifers around the world.\nGlasgow Botanic Gardens has been part of the programme since its establishment in 1991 and we are one of 300\nsafe sites across Britain and Ireland. The Gardens has many rare and endangered conifers growing in the grounds\nincluding _Torreya taxifolia_ from California which is critically endangered due to habitat loss and disease and\n_Podocarpus salignus_ that is hardy down to around -25c and likes west coast of Scotland conditions.\nTo find out more about these conifers and more threatened species go [here][1].\n\n[1]: http://www.threatenedconifers.rbge.org.uk"}